'''2) შექმენით პროგრამა რომელშიც მომხმარებელს შემოტანინებთ 2 რიცხვს და შეინახავთ ცვლადებში: number1 და number2, ამის შემდეგ დაბეჭდეთ ამ ცვლადების ჯამი. ასევე მოხმმარებლს შემოატანინეთ ამჟამინდელი level, შემდეგ დაუმატეთ ერთი და დაბეჭდეტ მიღებული შედეგი, საბოლოოდ კოდი რამდენჯერმე გაუშვით გამოიტანეთ დასკვნა და დაწერეთ კომენტარებით, ასევე ახსენით რა არის input და output'''

number1 = input("Enter first number: ")
number2 = input("Enter second number: ")

print(number1 + number2)

# level = input("Enter your current level: ")

# input-ით პროგრამაში შეტანილი ინფორმაცია ყოველთვის string მონაცემთა ტიპის სახით ინახება
