# File Handling - ფაილებთან მუშაობა

# open() - გამოიყენება ფაილის გახსნითვის, ფუნქცია პირველ პარამეტრად ღებულობს გასახსნელი ფაილის მისამართს (დასახელებას თუ იგივე ფოლდერშია) მეორე პარამეტრად კი modes (რეჟიმი)
# .read() - მეთოდი რომლითაც ვკითუხლობთ ფაილის ინფორმაციას
# .write() - მეთოდი რომლითაც ფაილში ვწერთ ინფორმაციას
# .close() - მეთოდი რომლთაც ვხურავთ ფაილს რომ თავიდან ავირდიოთ ზედმეტი პრობლემები და ბაგები კოდში

# ცვლადზე რომელშიც ფაილს შეინახავთ შეგიძლიათ გაიგოთ შემდეგი ინფორმაცია . (dot notation) სინტაქსის  გამოყეენბით

# .closed - ფაილი დავხურეთ თუ არა
# .mode - რა რეჟიმში ვიმყოფებით ფაილთან მიმართებით

# r - წაკითხვის (.read(), .readlines(), readline())
# w - წერის (.write())
# a - დამატების რეჟიმი და წერის რეჟიმისგან განსხვავებით წინა ინფორმაციას არ წაშლის და დაუმატებს ახალს (.write())
# x - ფაილის შექმნის რეჟიმი და შეიქმნა open ფუნქციით კონკრეტულ მისამართზე შესბამისი დასახელების და გაფართოების ფაილი თუ უკვე არ არსებობს
# r+ - წერა/კითხვის რეჟიმი (.read(), .write())

# data_file = open("data.txt", "a")

# data_file.write("\neerterter")

# data_file.close()

# file_name  = "data.txt"

# Error Handling

# პროგრამირებაში არსებობს 2 ტიპის ხარვეზი: error და bug

# error - შეცდომა რომელიც უშუალოდ აფერხებს კოდის გაშვებას
# bug - ლოგიკური ხარვეზი რომელიც კოდის გაშევას არ უშლის არ ხელს, მაგრამ კოდი არ გვაძლევს სასურველ შედგს

# error არსებობს ძირითადი და exception (გამონაკლისი)

# ძირითადი Errors

# SystemError - პითონის ინტერპრეტერის შიდა პრობლემა
# RecurssionError - გადააჭარებთ რეკურსიის ლიმიტს
# MemoryError - მეხსირების უკმარისობის პრობლემა

# Exceptions (გამონაკლისები) - სტანდარტული error-ები რომლებთანაც მოპყრობა შესაძლებლია try-except ბლოკის გამოყეენბით

# (გამონაკლისები) Exceptions:
# SyntaxError - სინტაქსური, წერითი შეცდომა - print(
# TypeError - დავალებას არასწორ მონაცემთა ტიპებს შორის ახდენ "eerter" + 2
# IndexError - ის პოზიცია რომელსაც ვცდილობ მივწვდე არ არსებობს [11, 12, 13, 14][10]
# NameError - არ არსებობს ისეთი ცვლადი ან ფუნქცია რომლის გამოძახებას ვცდილობ print(my_variable)
# ValueError - ფუნქციას გადავეცით სწორი ტიპი მაგრამ არასწორი მნიშვნელობა int("eyterer")
# KeyError - dictionary-იდან როდესაც ვცდილობ მივწდვე ისეთ გასაღებს რომელიც არ არსებობს dictionay-ში errors = {
#     "Irakli": "Top speed at writing classworks",
#     "Zurabi": "The most projects completed"
# }
# print(errors["Luka"])
# FileNotFoundError - არ არსებობს კონკრეტული ფაილი ან ფოლდერი open("xmax.gift1", "r+")
# ZeroDivisionError - ნულზე გაყოფის შეცდომა 10 / 0

# Context Manager - კონცეფცია ფაილებთან უსაფრთოდ მუშაობის

with open("data.txt", "r+") as file:
    lines = file.readlines()

    for line in lines:
        line = line
        print(line, end="")