'''1) შექმენით ცვლადი რომელშიც შეინახავთ მომხმარებლის ანგარიშის ემაილს, კომენმტარებით ახსენით თუ რატომ არ ვწერთ ამ ცვლადის სახელის სიტყვებს შეერთებულად და რა ქვია იმ მიდგომას რომელსაც თქვენ იყენებთ, ასევე დაწერეთ თქვენი სიტყვებით თუ რა არის ცვლადი და ჩამოწერეთ მისი შექმნის ნაბიჯები (3), საობლოოდ შექმენით ცვლადი number შემდეგ შეცვალეთ მისი მნიშვნელობა Number = 10-ით, საბოლოოდ კი NuMBEr = 20-ით და დაბეჭდეთ ეს მნიშვნელობა აღწერეთ რა შედეგი მიიღეთ და რატომ რას ნიშნავს python არის case senseitive'''

# ცვლადი არის კომპიუტერის მეხისრების გარკვეულ მისამართზე დარქმეული სახელი, ამ მისამართზე ჩაწერილი ინფორმაცია შეიძლება შეიცვალოს
# 1. ცვლადის სახელი (myname)
# 2. ტოლობის ნიშანი (=)
# 3. ცვლადის მნიშვნელობა ("Luka")

# myname = "Luka"
# ცვალადებს დავარქვათ აღმწერი სახელები
# balance = 300

# როდესაც ცვლადის სახელში გვაქვს რამდენიმე სიტყვა მათ ვაშორებთ ქვედატირებიის მეშვეობით, რადგან ცვლადის სახელში space-ის გამოყენება არ შეიძლება, ამას ვუწოდებთ snake_case-ს 
# user_credit_account = "Snake case"

# პითონის არის Case Sensitive ენა
# Number = 15
# number = 5

# print(number)

# FRUIT = "Apple"
# print(FRUIT)

# data type - მონაცემთა ტიპი
# integer - მთელი რიცხვი
# string - ტექსტი ბრჭყალებში


# 2 სტრინგის დამატებისას ხდება მათი შეერთება, პირელ სტრინგს მეორე ემატება ბოლოს ამ მოვლენას ჰქვია კონკატინაცია
# print("G" + "OA")

# 2 ინტეჯერის დამატებისას ისინი მათემატიკურად იკრიბებიან, ხდება ჯამი
# print(12 + 5)

# fruit = "Apple"
# fruit = "Grapes"

# fruit += "s"

# print(fruit)

# მინიჭების ოპერატორები, assignment operators
# +=, -=, *=, /= 

# aura = 200
# aura += 50
# print(aura)

# salary = 1000
# pay_raise = 100
# new_salary = salary + pay_raise
# print(new_salary)

# a = 3
# a = 5
# a = 7
# print(a)

# user = "Nika"
# welcome_message = f'Hello {user}'

# print(welcome_message)

# print("Banana" * 3)

# vegetable = "Tomato"
# vegetable *= 3
# print(vegetable)

# input - ინფომრაციის შეტანა
# output - ინფორმაციის გამოტანა

# output - გამოაქვს ინფორმაცია
# print()

# username = input("Enter your name: ")
# print("Welcome " + username + "!")